#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/etimo-kubernetes/etimo-kubernetes/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/etimo-kubernetes/etimo-kubernetes

To view this run in a browser, visit:
https://app.terraform.io/app/etimo/etimo-kubernetes/runs/run-QRqHtowfsAXNxtLB

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.environment[1].digitalocean_project.project: Refreshing state... [id=0a8555a1-44c0-41dd-9d0b-3b340ef5f1d8]
module.environment[0].digitalocean_project.project: Refreshing state... [id=0181b232-74c6-423f-8668-b042938c6c74]
module.environment[0].module.kubernetes.digitalocean_kubernetes_cluster.cluster: Refreshing state... [id=fefd9159-a36a-4ad2-883d-7c9563ffdf1d]
module.environment[1].module.kubernetes.digitalocean_kubernetes_cluster.cluster: Refreshing state... [id=10b9578c-0187-42dc-9f2c-a3a1e3f28406]
module.environment[1].module.project_bind.digitalocean_project_resources.resources: Refreshing state... [id=0a8555a1-44c0-41dd-9d0b-3b340ef5f1d8]
module.environment[0].module.project_bind.digitalocean_project_resources.resources: Refreshing state... [id=0181b232-74c6-423f-8668-b042938c6c74]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.environment[1].digitalocean_project.project has changed
  ~ resource "digitalocean_project" "project" {
        id          = "0a8555a1-44c0-41dd-9d0b-3b340ef5f1d8"
        name        = "[production] etimo"
      ~ resources   = [
          + "do:kubernetes:10b9578c-0187-42dc-9f2c-a3a1e3f28406",
        ]
        # (7 unchanged attributes hidden)
    }

  # module.environment[0].module.kubernetes.digitalocean_kubernetes_cluster.cluster has changed
  ~ resource "digitalocean_kubernetes_cluster" "cluster" {
        id             = "fefd9159-a36a-4ad2-883d-7c9563ffdf1d"
      ~ ipv4_address   = "159.89.0.106" -> "164.92.183.0"
        name           = "etimo-staging"
        tags           = []
      ~ updated_at     = "2022-03-20 04:01:28 +0000 UTC" -> "2022-03-20 15:55:17 +0000 UTC"
      ~ version        = "1.21.10-do.0" -> "1.22.7-do.0"
        # (12 unchanged attributes hidden)


      ~ node_pool {
            id                = "0e3b0bb0-c387-4bc6-aeee-57975fe732e8"
            name              = "basic"
          ~ nodes             = [
              ~ {
                  ~ created_at = "2022-03-19 13:15:46 +0000 UTC" -> "2022-03-20 15:50:56 +0000 UTC"
                  ~ droplet_id = "291372952" -> "291501908"
                  ~ id         = "80aed487-f128-4547-aaf6-03babccafcc3" -> "39a1d064-0b68-4f36-8871-9afdf36eb340"
                  ~ name       = "basic-c3jtf" -> "basic-c3a52"
                  ~ updated_at = "2022-03-19 13:21:07 +0000 UTC" -> "2022-03-20 15:51:37 +0000 UTC"
                    # (1 unchanged element hidden)
                },
            ]
            tags              = []
            # (7 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.environment[1].module.kubernetes.digitalocean_kubernetes_cluster.cluster has changed
  ~ resource "digitalocean_kubernetes_cluster" "cluster" {
        id             = "10b9578c-0187-42dc-9f2c-a3a1e3f28406"
        name           = "etimo-production"
      + tags           = []
      ~ updated_at     = "2022-03-20 06:01:20 +0000 UTC" -> "2022-03-20 06:01:29 +0000 UTC"
        # (14 unchanged attributes hidden)


      ~ node_pool {
            id                = "2056ebf5-d857-4c38-adfa-aafeb544bbf0"
          + labels            = {}
            name              = "basic"
          + tags              = []
            # (7 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.environment[0].module.kubernetes.digitalocean_kubernetes_cluster.cluster must be replaced
-/+ resource "digitalocean_kubernetes_cluster" "cluster" {
      ~ cluster_subnet = "10.244.0.0/16" -> (known after apply)
      ~ created_at     = "2022-03-19 13:15:46 +0000 UTC" -> (known after apply)
      ~ endpoint       = "https://fefd9159-a36a-4ad2-883d-7c9563ffdf1d.k8s.ondigitalocean.com" -> (known after apply)
      ~ id             = "fefd9159-a36a-4ad2-883d-7c9563ffdf1d" -> (known after apply)
      ~ ipv4_address   = "164.92.183.0" -> (known after apply)
      ~ kube_config    = (sensitive value)
        name           = "etimo-staging"
      ~ service_subnet = "10.245.0.0/16" -> (known after apply)
      ~ status         = "running" -> (known after apply)
      - tags           = [] -> null
      ~ updated_at     = "2022-03-20 15:55:17 +0000 UTC" -> (known after apply)
      ~ urn            = "do:kubernetes:fefd9159-a36a-4ad2-883d-7c9563ffdf1d" -> (known after apply)
      ~ version        = "1.22.7-do.0" -> "1.21.10-do.0" # forces replacement
        # (5 unchanged attributes hidden)

      ~ maintenance_policy {
          ~ duration   = "4h0m0s" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ node_pool {
          ~ actual_node_count = 1 -> (known after apply)
          ~ id                = "0e3b0bb0-c387-4bc6-aeee-57975fe732e8" -> (known after apply)
          - labels            = {} -> null
            name              = "basic"
          - node_count        = 0 -> null
          ~ nodes             = [
              - {
                  - created_at = "2022-03-20 15:50:56 +0000 UTC"
                  - droplet_id = "291501908"
                  - id         = "39a1d064-0b68-4f36-8871-9afdf36eb340"
                  - name       = "basic-c3a52"
                  - status     = "running"
                  - updated_at = "2022-03-20 15:51:37 +0000 UTC"
                },
            ] -> (known after apply)
          - tags              = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.environment[0].module.project_bind.digitalocean_project_resources.resources will be updated in-place
  ~ resource "digitalocean_project_resources" "resources" {
        id        = "0181b232-74c6-423f-8668-b042938c6c74"
      ~ resources = [
          - "do:kubernetes:fefd9159-a36a-4ad2-883d-7c9563ffdf1d",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ cluster_endpoints = [
      - "https://fefd9159-a36a-4ad2-883d-7c9563ffdf1d.k8s.ondigitalocean.com",
      + (known after apply),
        "https://10b9578c-0187-42dc-9f2c-a3a1e3f28406.k8s.ondigitalocean.com",
    ]
  ~ cluster_ids       = [
      - "fefd9159-a36a-4ad2-883d-7c9563ffdf1d",
      + (known after apply),
        "10b9578c-0187-42dc-9f2c-a3a1e3f28406",
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "pvt_key" but a value was
│ found in file "/terraform/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @indrif, Action: `pull_request`*